Саракташ2/src/Catalogs/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыДоставки</name>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СборКурьерки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыделятьЦветом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СборПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DPD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Саракташ2/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СпособыДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Саракташ2/src/Catalogs/СпособыДоставки/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСтоимость();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтоимость()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	вт.Цена КАК Цена
	|ИЗ
	|	вт КАК вт";
	Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	Если Выб.Следующий() Тогда 
		Стоимость = Выб.Цена;
	Иначе
		Стоимость = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Модифицированность ИЛИ Параметры.Ключ.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо записать элемент!");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СпособДоставки", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("СтараяСтоимость", Стоимость);
	
	Оповещение = Новый ОписаниеОповещения("РедактированиеСтоимостиПродолжение", ЭтаФорма);
	ОткрытьФорму("Справочник.СпособыДоставки.Форма.ВводНовойСтоимости", ПараметрыОткрытия, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеСтоимостиПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСтоимость();
	
КонецПроцедуры
